<template>
  <div class="login-container">
    <div class="login-logo">
      <h1>网上购物</h1>
    </div>
    <div class="login-title">
      <span :class="{select:loginPattern}"  @click="switchPattern(true)">验证码登录</span>
      <span :class="{select:!loginPattern}" @click="switchPattern(false)">密码登录</span>
    </div>
    <div class="login-content">
      <form>
        <!-- 验证码登录 -->
        <div class="login-verification" v-show="loginPattern">
          <section class="phone">
            <svg t="1579103515045" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="10607" width="22" height="22"><path d="M798.723234 174.782745c0-60.576657-49.106418-109.683075-109.683075-109.683075l-354.708628 0c-60.576657 0-109.683075 49.106418-109.683075 109.683075l0 673.980161c0 60.576657 49.106418 109.683075 109.683075 109.683075l354.708628 0c60.576657 0 109.683075-49.106418 109.683075-109.683075L798.723234 174.782745zM264.557398 237.015112l494.256894 0 0 529.049305-494.256894 0L264.557398 237.015112zM334.356091 105.008612 689.016623 105.008612c38.548968 0 69.798692 31.249725 69.798692 69.798692l0 22.298865-494.256894 0 0-22.298865C264.557398 136.25936 295.807123 105.008612 334.356091 105.008612zM689.016623 918.53704 334.356091 918.53704c-38.548968 0-69.798692-31.249725-69.798692-69.798692l0-43.788296 494.256894 0 0 43.788296C758.814292 887.287315 727.564567 918.53704 689.016623 918.53704z" p-id="10608" fill="#aaaaaa"></path><path d="M513.173732 829.943282c-16.70752 0-30.30112 13.5936-30.30112 30.30112 0 16.70752 13.5936 30.30112 30.30112 30.30112s30.299073-13.5936 30.299073-30.30112C543.472805 843.536882 529.881253 829.943282 513.173732 829.943282z" p-id="10609" fill="#aaaaaa"></path></svg>
            <input ref="phone1" type="tel" maxlength="11" placeholder="手机号" v-model="phone">
            <button v-if="countdown === 0"  class="verification-code" :class="{isright:phoneRight}" @click.prevent="getVerifyCode()">获取验证码</button>
            <button v-else disabled="disabled" class="verification-code">已发送({{countdown}}s)</button>
          </section>
          <section class="code">
            <svg t="1579103641779" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="11503" width="18" height="18"><path d="M916.210526 1024 107.789474 1024C78.012632 1024 53.894737 999.855158 53.894737 970.105263L53.894737 485.052632C53.894737 455.275789 78.012632 431.157895 107.789474 431.157895L188.631579 431.157895 188.631579 323.368421C188.631579 144.761263 333.419789 0 512 0 690.580211 0 835.368421 144.761263 835.368421 323.368421L835.368421 431.157895 916.210526 431.157895C945.987368 431.157895 970.105263 455.275789 970.105263 485.052632L970.105263 970.105263C970.105263 999.855158 945.987368 1024 916.210526 1024ZM781.473684 323.368421C781.473684 174.538105 660.830316 53.894737 512 53.894737 363.169684 53.894737 242.526316 174.538105 242.526316 323.368421L242.526316 431.157895 781.473684 431.157895 781.473684 323.368421ZM916.210526 485.052632 835.368421 485.052632 188.631579 485.052632 107.789474 485.052632 107.789474 970.105263 916.210526 970.105263 916.210526 485.052632ZM512 592.842105C526.874947 592.842105 538.947368 604.914526 538.947368 619.789474L538.947368 835.368421C538.947368 850.243368 526.874947 862.315789 512 862.315789 497.125053 862.315789 485.052632 850.243368 485.052632 835.368421L485.052632 619.789474C485.052632 604.914526 497.125053 592.842105 512 592.842105Z" p-id="11504" fill="#aaaaaa"></path></svg>
            <input type="tel" maxlength="6" placeholder="验证码" v-model="verifyCode">
          </section>
        </div>
        <!-- 密码登录 -->
        <div class="login-cipher" v-show="!loginPattern">
          <section class="phone">
            <svg t="1579103515045" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="10607" width="22" height="22"><path d="M798.723234 174.782745c0-60.576657-49.106418-109.683075-109.683075-109.683075l-354.708628 0c-60.576657 0-109.683075 49.106418-109.683075 109.683075l0 673.980161c0 60.576657 49.106418 109.683075 109.683075 109.683075l354.708628 0c60.576657 0 109.683075-49.106418 109.683075-109.683075L798.723234 174.782745zM264.557398 237.015112l494.256894 0 0 529.049305-494.256894 0L264.557398 237.015112zM334.356091 105.008612 689.016623 105.008612c38.548968 0 69.798692 31.249725 69.798692 69.798692l0 22.298865-494.256894 0 0-22.298865C264.557398 136.25936 295.807123 105.008612 334.356091 105.008612zM689.016623 918.53704 334.356091 918.53704c-38.548968 0-69.798692-31.249725-69.798692-69.798692l0-43.788296 494.256894 0 0 43.788296C758.814292 887.287315 727.564567 918.53704 689.016623 918.53704z" p-id="10608" fill="#aaaaaa"></path><path d="M513.173732 829.943282c-16.70752 0-30.30112 13.5936-30.30112 30.30112 0 16.70752 13.5936 30.30112 30.30112 30.30112s30.299073-13.5936 30.299073-30.30112C543.472805 843.536882 529.881253 829.943282 513.173732 829.943282z" p-id="10609" fill="#aaaaaa"></path></svg>
            <input ref="phone2" type="text" maxlength="11" placeholder="用户名/手机号/邮箱" v-model="username">
          </section>
          <section class="code">
            <svg t="1579103641779" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="11503" width="18" height="18"><path d="M916.210526 1024 107.789474 1024C78.012632 1024 53.894737 999.855158 53.894737 970.105263L53.894737 485.052632C53.894737 455.275789 78.012632 431.157895 107.789474 431.157895L188.631579 431.157895 188.631579 323.368421C188.631579 144.761263 333.419789 0 512 0 690.580211 0 835.368421 144.761263 835.368421 323.368421L835.368421 431.157895 916.210526 431.157895C945.987368 431.157895 970.105263 455.275789 970.105263 485.052632L970.105263 970.105263C970.105263 999.855158 945.987368 1024 916.210526 1024ZM781.473684 323.368421C781.473684 174.538105 660.830316 53.894737 512 53.894737 363.169684 53.894737 242.526316 174.538105 242.526316 323.368421L242.526316 431.157895 781.473684 431.157895 781.473684 323.368421ZM916.210526 485.052632 835.368421 485.052632 188.631579 485.052632 107.789474 485.052632 107.789474 970.105263 916.210526 970.105263 916.210526 485.052632ZM512 592.842105C526.874947 592.842105 538.947368 604.914526 538.947368 619.789474L538.947368 835.368421C538.947368 850.243368 526.874947 862.315789 512 862.315789 497.125053 862.315789 485.052632 850.243368 485.052632 835.368421L485.052632 619.789474C485.052632 604.914526 497.125053 592.842105 512 592.842105Z" p-id="11504" fill="#aaaaaa"></path></svg>
            <input v-if="pwdPattern" type="password" maxlength="20" placeholder="密码" v-model="password">
            <input v-else type="text" maxlength="20" placeholder="密码" v-model="password">
            <img v-if="pwdPattern" src="./images/hide.png" alt="" @click.prevent="showPwd(false)">
            <img v-else src="./images/show.png" alt="" @click.prevent="showPwd(true)">
          </section>
          <section class="captcha">
            <svg t="1579169176072" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="2126" width="22" height="22"><path d="M964.487963 357.348523c-4.886424 70.287753-4.001239 141.573257-15.95379 210.638125-20.435997 118.087723-85.131225 211.52331-181.247949 282.803698-66.926098 49.631739-134.379214 98.542028-201.627662 147.743966-30.009294 21.955649-60.985639 23.347384-89.618548 2.312737-76.064478-55.874082-153.239274-110.382012-227.129166-169.024214-94.745455-75.194643-153.822575-174.918623-163.748923-295.150232-9.220247-111.696997-5.526008-224.519662-5.771608-336.851127-0.056283-24.462819 15.401189-43.941998 39.331874-51.668176 127.701954-41.235277 255.465308-82.311937 383.842662-121.367511 16.209624-4.932474 37.126588-0.844251 54.170229 4.47709 118.44589 36.983321 236.472213 75.302094 354.559936 113.421316 32.716015 10.560815 48.403738 32.301564 48.547004 66.603748 0.19955 48.582821 0.051167 97.165642 0.051167 145.748463C961.428192 357.13874 962.958077 357.24619 964.487963 357.348523zM123.577914 358.970509c0 37.510338-0.603768 75.036027 0.10745 112.536132 2.563454 135.136481 57.598401 245.743627 162.060421 329.841283 66.163714 53.264578 137.121751 100.542647 205.1377 151.550772 20.40018 15.298856 36.870754 14.966272 57.086734-0.2763 63.804927-48.112087 129.088572-94.259371 192.878149-142.386809 100.864998-76.105411 162.587438-176.397342 170.697367-303.301094 5.863709-91.701034 2.604387-183.990486 3.300255-276.024104 0.1842-24.667486-12.367001-38.405756-35.929286-45.886334-111.763514-35.468785-223.07676-72.360006-334.983541-107.363174-14.459721-4.52314-32.685315-5.050157-47.032469-0.578184-112.766382 35.156668-224.898296 72.344656-337.500944 108.023225-24.92332 7.895028-36.15442 22.912467-35.898586 48.536771C123.920732 275.420337 123.618848 317.197981 123.577914 358.970509z" p-id="2127" fill="#bfbfbf"></path><path d="M519.536861 307.2921c70.75337-0.01535 141.511857-0.081867 212.265228 0.040933 13.61547 0.025583 29.789277-1.739669 28.576625 19.187528-0.997751 17.186909-10.985499 24.72377-29.001309 24.467936-51.990526-0.741918-104.052686 1.141018-155.976695-0.844251-26.202488-1.002868-33.95425 7.976895-33.723999 33.263499 0.972168 106.549623 0.639584 213.119712 0.01535 319.674452-0.056283 10.003098-2.911388 22.426383-9.296997 29.113876-4.38499 4.594773-19.310328 4.502673-25.511737 0.414451-5.771608-3.801689-8.616479-15.651906-8.662529-23.976735-0.547484-108.263709-0.3377-216.527417-0.383751-324.791126-0.01535-32.889982-0.158617-33.033248-32.644381-33.084415-49.442422-0.081867-98.889962-0.020467-148.332384-0.025583-5.116674 0-11.911617 2.041553-15.022555-0.465617-8.790446-7.086594-20.61508-14.945805-22.932934-24.513986-3.883556-16.03054 10.269165-18.455844 23.250167-18.450727C374.617299 307.327917 447.074522 307.30745 519.536861 307.2921z" p-id="2128" fill="#bfbfbf"></path></svg>
            <input type="tel" maxlength="4" placeholder="验证码" v-model="captcha">
            <img ref="captcha" src="http://127.0.0.1:3000/api/captcha" alt="" @click.prevent="getCaptcha()">
          </section>
        </div>
        <button class="submit-btn">登录</button>
      </form>
    </div>
    <button class="back-btn" @click="backHome()">返回</button>
  </div>
</template>

<script>
import {getPhoneCode} from '../../api/index'
import { MessageBox } from 'mint-ui';

export default {
  name:'Login',
  data(){
    return {
      loginPattern: true, // 登录方式 true代表验证码登录 false代表密码登录
      phone: '',  // 手机号
      verifyCode: '', // 验证码
      countdown: 0,  // 验证码计时
      username: '', // 账号
      password: '', // 密码
      pwdPattern: true, // 密码显示方式 true密文 false明文
      captcha: ''
    }
  },
  methods:{
    // 切换登录方式
    switchPattern(flag){
      this.loginPattern = flag;
      if(flag){
        this.$nextTick(()=>{
          this.$refs.phone1.focus();
        })
      }
      else{
        this.$nextTick(()=>{
          this.$refs.phone2.focus();
        })
      }
    },
    // 获取验证码并倒计时
    async getVerifyCode(){
      this.countdown = 10;
      let interval = setInterval(() => {
        this.countdown--;
        if(this.countdown === 0){
          clearInterval(interval);
        }
      }, 1000);
      let code = await getPhoneCode(this.phone);
      console.log(code);
      MessageBox('短信消息', '验证码：' + code.message);
    },
    // 密码显示方式
    showPwd(flag){
      this.pwdPattern = flag;
    },
    // 获取图形验证码
    getCaptcha(){
      this.$refs.captcha.src = 'http://127.0.0.1:3000/api/captcha?time=' + new Date();
    },
    // 获取手机验证码

    // 返回首页
    backHome(){
      this.$router.push('/')
    }
  },
  computed:{
    phoneRight(){
      return /^[1][3,4,5,7,8][0-9]{9}$/.test(this.phone);
    }
  },
  mounted(){
    this.$refs.phone1.focus();
  }
}
</script>

<style scoped lang="stylus" ref="stylesheet/stylus">
.login-container
  width 100%
  height 100%
  background-color #f5f5f5
  display flex
  flex-direction column
  align-items center
  position fixed
  .login-logo
    font-family 'STHupo'
    color #FF0000
    font-size 45px
    margin 85px 0
  .login-title
    font-size 16px
    color #666666
    font-family 'Microsoft Yahei'
    width 60%
    display flex
    justify-content space-between
    .select
      color #ff5000
      height 25px
      border-bottom 2px solid #ff5000
  .login-content
    margin-top 30px
    width 100%
    .login-verification,.login-cipher
      width 100%
      .phone,.code,.captcha
        width 100%
        height 60px
        display flex
        align-items center
        background-color #fff
        margin-bottom 1px
        padding-left 10px
        input
          width 60%
          height 100%
          padding 0
          margin 0 10px
          border none
          outline none 
          font-size 16px
          color #666666
        .verification-code
          width 90px
          height 30px
          color #FFE0B2
          background-color transparent
          border 1px solid #FFE0B2
          margin-right 10px
          border-radius 5px
          pointer-events none
        .isright
          border 1px solid #FF9800
          color #FF9800
          pointer-events auto
    .submit-btn
      width 90%
      display block
      margin 15px auto
      height 40px
      border none 
      background-color #ffbb00
      border-radius 5px
  .back-btn
    width 90%
    display block
    margin 0 auto
    height 40px
    border 1px solid #ffbb00 
    background-color #fff
    border-radius 5px
</style>